OsmoBSC> ### Neighbor-BSS Cell Identifier List config

OsmoBSC> list
...
  show bts <0-255> neighbor arfcn <0-1023> bsic (<0-63>|any)
...

OsmoBSC> enable
OsmoBSC# list
...
  show bts <0-255> neighbor arfcn <0-1023> bsic (<0-63>|any)
...

OsmoBSC# configure terminal
OsmoBSC(config)# network

OsmoBSC(config-net)# bts 0
OsmoBSC(config-net-bts)# type sysmobts
OsmoBSC(config-net-bts)# base_station_id_code 10
OsmoBSC(config-net-bts)# location_area_code 20
OsmoBSC(config-net-bts)# cell_identity 30
OsmoBSC(config-net-bts)# trx 0
OsmoBSC(config-net-bts-trx)# arfcn 40
OsmoBSC(config-net-bts-trx)# exit
OsmoBSC(config-net-bts)# exit

OsmoBSC(config-net)# bts 1
OsmoBSC(config-net-bts)# type sysmobts
OsmoBSC(config-net-bts)# base_station_id_code 11
OsmoBSC(config-net-bts)# location_area_code 21
OsmoBSC(config-net-bts)# cell_identity 31
OsmoBSC(config-net-bts)# trx 0
OsmoBSC(config-net-bts-trx)# arfcn 41
OsmoBSC(config-net-bts-trx)# exit
OsmoBSC(config-net-bts)# exit

OsmoBSC(config-net)# bts 2
OsmoBSC(config-net-bts)# type sysmobts
OsmoBSC(config-net-bts)# base_station_id_code 12
OsmoBSC(config-net-bts)# location_area_code 22
OsmoBSC(config-net-bts)# cell_identity 65535
OsmoBSC(config-net-bts)# trx 0
OsmoBSC(config-net-bts-trx)# arfcn 42
OsmoBSC(config-net-bts-trx)# exit
OsmoBSC(config-net-bts)# exit

OsmoBSC(config-net)# show running-config
...
 bts 0
...
  cell_identity 30
  location_area_code 20
  base_station_id_code 10
...
  trx 0
...
   arfcn 40
...
 bts 1
...
  cell_identity 31
  location_area_code 21
  base_station_id_code 11
...
  trx 0
...
   arfcn 41
...
 bts 2
...
  cell_identity 65535
  location_area_code 22
  base_station_id_code 12
...
  trx 0
...
   arfcn 42
...

OsmoBSC(config-net)# bts 0
OsmoBSC(config-net-bts)# list
...
  neighbor bts <0-255>
  neighbor lac <0-65535>
  neighbor lac-ci <0-65535> <0-65535>
  neighbor cgi <0-999> <0-999> <0-65535> <0-65535>
  neighbor lac <0-65535> arfcn <0-1023> bsic (<0-63>|any)
  neighbor lac-ci <0-65535> <0-65535> arfcn <0-1023> bsic (<0-63>|any)
  neighbor cgi <0-999> <0-999> <0-65535> <0-65535> arfcn <0-1023> bsic (<0-63>|any)
  no neighbor bts <0-255>
  no neighbor arfcn <0-1023> bsic (<0-63>|any)
...

OsmoBSC(config-net-bts)# neighbor?
  neighbor  Manage local and remote-BSS neighbor cells

OsmoBSC(config-net-bts)# neighbor ?
  bts     Add Neighbor cell by local BTS number
  lac     Add Neighbor cell by LAC
  lac-ci  Add Neighbor cell by LAC and CI
  cgi     Add Neighbor cell by cgi

OsmoBSC(config-net-bts)# neighbor bts ?
  <0-255>  BTS number
OsmoBSC(config-net-bts)# neighbor bts 0 ?
  <cr>  

OsmoBSC(config-net-bts)# neighbor lac ?
  <0-65535>  LAC
OsmoBSC(config-net-bts)# neighbor lac 0 ?
  arfcn  ARFCN of neighbor cell
  <cr>   
OsmoBSC(config-net-bts)# neighbor lac 0 arfcn ?
  <0-1023>  ARFCN value
OsmoBSC(config-net-bts)# neighbor lac 0 arfcn 0 ?
  bsic  BSIC of neighbor cell
OsmoBSC(config-net-bts)# neighbor lac 0 arfcn 0 bsic ?
  <0-63>  BSIC value
  any     for all BSICs / use any BSIC in this ARFCN
OsmoBSC(config-net-bts)# neighbor lac 0 arfcn 0 bsic 0 ?
  <cr>  

OsmoBSC(config-net-bts)# neighbor lac-ci ?
  <0-65535>  LAC
OsmoBSC(config-net-bts)# neighbor lac-ci 0 ?
  <0-65535>  CI
OsmoBSC(config-net-bts)# neighbor lac-ci 0 0 ?
  arfcn  ARFCN of neighbor cell
  <cr>   
OsmoBSC(config-net-bts)# neighbor lac-ci 0 0 arfcn ?
  <0-1023>  ARFCN value
OsmoBSC(config-net-bts)# neighbor lac-ci 0 0 arfcn 0 ?
  bsic  BSIC of neighbor cell
OsmoBSC(config-net-bts)# neighbor lac-ci 0 0 arfcn 0 bsic ?
  <0-63>  BSIC value
  any     for all BSICs / use any BSIC in this ARFCN
OsmoBSC(config-net-bts)# neighbor lac-ci 0 0 arfcn 0 bsic 0 ?
  <cr>  

OsmoBSC(config-net-bts)# neighbor cgi ?
  <0-999>  MCC
OsmoBSC(config-net-bts)# neighbor cgi 0 ?
  <0-999>  MNC
OsmoBSC(config-net-bts)# neighbor cgi 0 0 ?
  <0-65535>  LAC
OsmoBSC(config-net-bts)# neighbor cgi 0 0 0 ?
  <0-65535>  CI
OsmoBSC(config-net-bts)# neighbor cgi 0 0 0 0 ?
  arfcn  ARFCN of neighbor cell
  <cr>   
OsmoBSC(config-net-bts)# neighbor cgi 0 0 0 0 arfcn ?
  <0-1023>  ARFCN value
OsmoBSC(config-net-bts)# neighbor cgi 0 0 0 0 arfcn 0 ?
  bsic  BSIC of neighbor cell
OsmoBSC(config-net-bts)# neighbor cgi 0 0 0 0 arfcn 0 bsic ?
  <0-63>  BSIC value
  any     for all BSICs / use any BSIC in this ARFCN
OsmoBSC(config-net-bts)# neighbor cgi 0 0 0 0 arfcn 0 bsic 0 ?
  <cr>  

OsmoBSC(config-net-bts)# no neighbor?
  neighbor  Remove local or remote-BSS neighbor cell

OsmoBSC(config-net-bts)# no neighbor ?
  bts    Neighbor cell by local BTS number
  arfcn  ARFCN of neighbor cell

OsmoBSC(config-net-bts)# no neighbor bts ?
  <0-255>  BTS number
OsmoBSC(config-net-bts)# no neighbor bts 0 ?
  <cr>  

OsmoBSC(config-net-bts)# no neighbor arfcn ?
  <0-1023>  ARFCN value
OsmoBSC(config-net-bts)# no neighbor arfcn 0 ?
  bsic  BSIC of neighbor cell
OsmoBSC(config-net-bts)# no neighbor arfcn 0 bsic ?
  <0-63>  BSIC value
  any     for all BSICs / use any BSIC in this ARFCN
OsmoBSC(config-net-bts)# no neighbor arfcn 0 bsic 0 ?
  <cr>  

OsmoBSC(config-net-bts)# show running-config
... !neighbor 

OsmoBSC(config-net-bts)# ! BSIC out of range
OsmoBSC(config-net-bts)# neighbor cgi 23 42 423 5 arfcn 23 bsic 64
% Unknown command.

OsmoBSC(config-net-bts)# neighbor bts 0
% Error: cannot add local BTS 0 as neighbor to BTS 0: Invalid argument

OsmoBSC(config-net-bts)# show running-config
... !neighbor 

OsmoBSC(config-net-bts)# neighbor bts 1
% BTS 0 now has local neighbor BTS 1 with LAC 21 CI 31 and ARFCN 41 BSIC 11

OsmoBSC(config-net-bts)# neighbor lac 22
% BTS 0 now has local neighbor BTS 2 with LAC 22 CI 65535 and ARFCN 42 BSIC 12
OsmoBSC(config-net-bts)# no neighbor bts 2
OsmoBSC(config-net-bts)# neighbor cgi 901 70 22 65535
% BTS 0 now has local neighbor BTS 2 with LAC 22 CI 65535 and ARFCN 42 BSIC 12

OsmoBSC(config-net-bts)# neighbor cgi 23 42 423 5 arfcn 23 bsic 42
% BTS 0 to ARFCN 23 BSIC 42 now has 1 remote BSS Cell Identifier List entry

OsmoBSC(config-net-bts)# ### adding the same entry again results in no change
OsmoBSC(config-net-bts)# neighbor bts 1
% BTS 0 already had local neighbor BTS 1 with LAC 21 CI 31 and ARFCN 41 BSIC 11
OsmoBSC(config-net-bts)# neighbor lac-ci 21 31
% BTS 0 already had local neighbor BTS 1 with LAC 21 CI 31 and ARFCN 41 BSIC 11
OsmoBSC(config-net-bts)# neighbor cgi 23 42 423 5 arfcn 23 bsic 42
% Error: only one Cell Identifier entry is allowed per remote neighbor. Already have: BTS 0 to ARFCN 23 BSIC 42 -> CGI[1]:{023-42-423-5}
OsmoBSC(config-net-bts)# neighbor cgi 23 42 423 5 arfcn 23 bsic 42
% Error: only one Cell Identifier entry is allowed per remote neighbor. Already have: BTS 0 to ARFCN 23 BSIC 42 -> CGI[1]:{023-42-423-5}
OsmoBSC(config-net-bts)# neighbor cgi 23 42 423 5 arfcn 23 bsic 42
% Error: only one Cell Identifier entry is allowed per remote neighbor. Already have: BTS 0 to ARFCN 23 BSIC 42 -> CGI[1]:{023-42-423-5}

OsmoBSC(config-net-bts)# neighbor cgi 23 042 423 6 arfcn 23 bsic 42
% Error: only one Cell Identifier entry is allowed per remote neighbor. Already have: BTS 0 to ARFCN 23 BSIC 42 -> CGI[1]:{023-42-423-5}

OsmoBSC(config-net-bts)# neighbor lac 456 arfcn 123 bsic 45
% BTS 0 to ARFCN 123 BSIC 45 now has 1 remote BSS Cell Identifier List entry

OsmoBSC(config-net-bts)# neighbor cgi 23 042 234 56 arfcn 23 bsic 42
% Error: only one Cell Identifier entry is allowed per remote neighbor. Already have: BTS 0 to ARFCN 23 BSIC 42 -> CGI[1]:{023-42-423-5}

OsmoBSC(config-net-bts)# neighbor lac-ci 789 10 arfcn 423 bsic any
% BTS 0 to ARFCN 423 (any BSIC) now has 1 remote BSS Cell Identifier List entry

OsmoBSC(config-net-bts)# neighbor lac-ci 789 10 arfcn 423 bsic 63
% Error: only one Cell Identifier entry is allowed per remote neighbor. Already have: BTS 0 to ARFCN 423 BSIC 63 -> LAC-CI[1]:{789-10}

OsmoBSC(config-net-bts)# neighbor lac-ci 789 10 arfcn 423 bsic 1
% Error: only one Cell Identifier entry is allowed per remote neighbor. Already have: BTS 0 to ARFCN 423 BSIC 1 -> LAC-CI[1]:{789-10}

OsmoBSC(config-net-bts)# show running-config
...
network
... !neighbor 
 bts 0
... !neighbor 
  neighbor bts 1
  neighbor bts 2
  neighbor cgi 023 42 423 5 arfcn 23 bsic 42
  neighbor lac 456 arfcn 123 bsic 45
  neighbor lac-ci 789 10 arfcn 423 bsic any
... !neighbor 

OsmoBSC(config-net-bts)# do show bts 0 neighbor arfcn 99 bsic any
% No entry for BTS 0 to ARFCN 99 (any BSIC)

OsmoBSC(config-net-bts)# do show bts 0 neighbor arfcn 41 bsic any
% BTS 0 to ARFCN 41 (any BSIC) resolves to local BTS 1 lac-ci 21 31

OsmoBSC(config-net-bts)# do show bts 0 neighbor arfcn 423 bsic 1
% neighbor lac-ci 789 10 arfcn 423 bsic 1

OsmoBSC(config-net-bts)# do show bts 0 neighbor arfcn 423 bsic 23
% neighbor lac-ci 789 10 arfcn 423 bsic 23

OsmoBSC(config-net-bts)# no neighbor arfcn 99 bsic 7
% Cannot remove, no such neighbor: BTS 0 to ARFCN 99 BSIC 7

OsmoBSC(config-net-bts)# no neighbor arfcn 23 bsic 42
% Removed remote BSS neighbor BTS 0 to ARFCN 23 BSIC 42

OsmoBSC(config-net-bts)# show running-config

Current configuration:
!
!
log stderr
 logging filter all 1
 logging color 1
 logging print category 0
 logging timestamp 0
 logging print file 1
 logging level rll notice
 logging level mm notice
 logging level rr notice
 logging level rsl notice
 logging level nm info
 logging level pag notice
 logging level meas notice
 logging level msc notice
 logging level ho notice
 logging level hodec notice
 logging level ref notice
 logging level nat notice
 logging level ctrl notice
 logging level filter debug
 logging level pcu debug
 logging level lcls notice
 logging level chan notice
 logging level ts notice
 logging level as notice
 logging level lglobal notice
 logging level llapd notice
 logging level linp notice
 logging level lmux notice
 logging level lmi notice
 logging level lmib notice
 logging level lsms notice
 logging level lctrl notice
 logging level lgtp notice
 logging level lstats notice
 logging level lgsup notice
 logging level loap notice
 logging level lss7 notice
 logging level lsccp notice
 logging level lsua notice
 logging level lm3ua notice
 logging level lmgcp notice
 logging level ljibuf notice
!
stats interval 5
!
line vty
 no login
!
e1_input
 e1_line 0 driver ipa
 e1_line 0 port 0
 no e1_line 0 keepalive
cs7 instance 0
 point-code 0.23.3
 asp asp-clnt-msc-0 2905 0 m3ua
 as as-clnt-msc-0 m3ua
  asp asp-clnt-msc-0
  routing-key 0 0.23.3
network
 network country code 901
 mobile network code 70
 encryption a5 1 3
 neci 0
 paging any use tch 0
 bts 0
  type sysmobts
  band DCS1800
  cell_identity 30
  location_area_code 20
  base_station_id_code 10
  ms max power 15
  cell reselection hysteresis 4
  rxlev access min 0
  radio-link-timeout 32
  channel allocator ascending
  rach tx integer 9
  rach max transmission 7
  channel-descrption attach 1
  channel-descrption bs-pa-mfrms 5
  channel-descrption bs-ag-blks-res 1
  no access-control-class-ramping
  access-control-class-ramping-step-interval dynamic
  access-control-class-ramping-step-size 1
  early-classmark-sending forbidden
  early-classmark-sending-3g allowed
  ip.access unit_id 1800 0
  oml ip.access stream_id 255 line 0
  neighbor-list mode automatic
  neighbor bts 1
  neighbor bts 2
  neighbor lac 456 arfcn 123 bsic 45
  neighbor lac-ci 789 10 arfcn 423 bsic any
... !neighbor 

OsmoBSC(config-net-bts)# no neighbor arfcn 123 bsic 45
% Removed remote BSS neighbor BTS 0 to ARFCN 123 BSIC 45

OsmoBSC(config-net-bts)# show running-config
... !neighbor 
  neighbor bts 1
  neighbor bts 2
  neighbor lac-ci 789 10 arfcn 423 bsic any
... !neighbor 

OsmoBSC(config-net-bts)# no neighbor arfcn 423 bsic any
% Removed remote BSS neighbor BTS 0 to ARFCN 423 (any BSIC)

OsmoBSC(config-net-bts)# show running-config
... !neighbor 
  neighbor bts 1
  neighbor bts 2
... !neighbor 

OsmoBSC(config-net-bts)# no neighbor arfcn 423 bsic 63
% Cannot remove, no such neighbor: BTS 0 to ARFCN 423 BSIC 63

OsmoBSC(config-net-bts)# show running-config
... !neighbor 
  neighbor bts 1
  neighbor bts 2
... !neighbor 

OsmoBSC(config-net-bts)# no neighbor arfcn 423 bsic 1
% Cannot remove, no such neighbor: BTS 0 to ARFCN 423 BSIC 1

OsmoBSC(config-net-bts)# show running-config
... !neighbor 
  neighbor bts 1
  neighbor bts 2
... !neighbor 

OsmoBSC(config-net-bts)# no neighbor arfcn 41 bsic any
% Removed local neighbor bts 0 to bts 1

OsmoBSC(config-net-bts)# show running-config
... !neighbor 
  neighbor bts 2
... !neighbor 

OsmoBSC(config-net-bts)# no neighbor arfcn 41 bsic any
% Cannot remove, no such neighbor: BTS 0 to ARFCN 41 (any BSIC)

OsmoBSC(config-net-bts)# show running-config
... !neighbor 
  neighbor bts 2
... !neighbor 

OsmoBSC(config-net-bts)# no neighbor arfcn 42 bsic 12
% Removed local neighbor bts 0 to bts 2

OsmoBSC(config-net-bts)# show running-config
... !neighbor 
